<template>
  <div>
    <el-button
      style="color: white; font-size: 14px; font-weight: 400; padding-top: 8px;;"
      type="text" @click="dialog = true" >Оплата и доставка</el-button>
  <el-dialog
    title="Оплата и доставка"
    center
    close-on-press-escape
    :visible.sync="dialog"
    width="60vw">
    <h3>Доставка</h3>
    <p>
      Разнообразный и богатый опыт укрепление и развитие структуры позволяет выполнять важные задания по разработке
      системы обучения кадров, соответствует насущным потребностям. Разнообразный и богатый опыт укрепление и развитие
      структуры способствует подготовки и реализации модели развития. Равным образом сложившаяся структура организации
      играет важную роль в формировании систем массового участия.
    </p>
    <h3>Оплата</h3>
    <p>
      Разнообразный и богатый опыт укрепление и развитие структуры позволяет выполнять важные задания по разработке
      системы обучения кадров, соответствует насущным потребностям. Разнообразный и богатый опыт укрепление и развитие
      структуры способствует подготовки и реализации модели развития. Равным образом сложившаяся структура организации
      играет важную роль в формировании систем массового участия.
    </p>
    <span slot="footer" class="dialog-footer">
    <el-button class="primary_btn" @click="dialog = false">Ок</el-button>
  </span>
  </el-dialog>
  </div>
</template>

<script>
  export default {
    name: "DeliveryAndPayment",
    data() {
      return {
        dialog: false
      }
    }
  }
</script>

<style scoped>
</style>
