<template>
  <div>
    <el-dialog
      title="Оплата и доставка"
      center
      close-on-press-escape
      :visible.sync="dialog"
      width="60vw">
      <h3>Доставка</h3>
      <p>
        Наш магазин освободит Вас от забот по самостоятельной доставке товаров, приобретенных в нашем магазине.
        Предоставьте это профессионалам и получайте удовольствие от результата. Доставка заказов осуществляется в
        максимально сжатые сроки в удобное для вас время. Мы приближаем радость от окончания ремонта, делая покупку
        сантехнического оборудования простой и комфортной!
      </p>
      <p>Доставка в течении 48 часов</p>
      <p>Сроки доставки крупногабаритных товаров уточняются при согласовании заказа с оператором.</p>

      <h4>Доставка по Бердску</h4>
      <ul>
        <li>Крупногабаритный товар 600 руб.(окончательная стоимость обсуждается при согласовании заказа с оператором)
        </li>
        <li>Среднегабаритный товар 400 руб. (От 3000 руб бесплатно)</li>
        <li>Мелкогабаритный товар 100 руб. (От 2000 руб бесплатно)</li>
      </ul>
      <h4>Доставка по Новосибирску</h4>
      <ul>
        <li>Мелкогабаритный товар 200 руб. (От 3000 руб бесплатно)</li>
        <li>Крупногабаритный товар 700 руб.</li>
        <li>Среднегабаритный товар 500 руб. (От 5000 руб бесплатно)</li>
      </ul>
      <h4>Доставка по Новосибирской области</h4>
      <ul>
        <li>Мелкогабаритный товар 400 руб. (От 5000 руб бесплатно)</li>
        <li>Среднегабаритный товар 800 руб. (От 7000 руб бесплатно)</li>
        <li>Крупногабаритный товар 1000 руб.</li>
      </ul>
      <b>Возможен самовызов</b>
      <p>Доставка в другие регионы (транспортными компаниями)</p>

      <p>Стоимость доставки заказа до терминала транспортной компании в г.Бердск
        и оформления груза («Деловые линии», «КИТ») 300 руб
      </p>
      <h3>Оплата</h3>
      <p>
        Оплата осуществляется в зависимости от способа доставки:
        это может быть как <b>электронный перевод средств</b> так и <b>наличный расчет</b>
      </p>
      <div slot="footer" class="dialog-footer">
        <el-button class="primary_btn" @click="dialog = false">Ок</el-button>
      </div>
    </el-dialog>
  </div>
</template>

<script>
  export default {
    name: "DeliveryAndPaymentDialog",
    data() {
      return {
        dialog: false
      }
    },
    created() {
      this.$bus.$on('openDeliveryAndPaymentDialog', () => {
        this.dialog = true
      })
    }
  }
</script>

<style scoped>
</style>
