<template>
  <div>
    <el-button type="text" @click="dialog = true">офертой</el-button>
    <el-dialog
      width="80vw"
      title="Настоящий Договор не требует двустороннего подписания и действителен в электронном виде."
      :visible.sync="dialog"
      append-to-body>
      <h4 style="margin-top: 0;">1. Термины.</h4>
      <p>В целях настоящего Договора Стороны используют указанные термины в следующем значении:</p>
      <p>1. Интернет-магазин (Сайт) – сайт, расположенный в сети Интернет по адресу http://santprice.ruпосредством
        которого Продавец осуществляет дистанционную торговлю Товарами;</p>
      <p>2. Товар - материальный объект, размещенный в Интернет-магазине и доступный для Заказа Покупателем.</p>
      <p>3. Бракованный Товар - это продукция, не соответствующая существующему описанию или образцу.</p>
      <p>4. Заказ - оформленный запрос Покупателя на приобретение и доставку Товаров, выбранных Покупателем в
        Интернет-магазине, по указанному Покупателем адресу.</p>
      <p>5. Покупатель - любое физическое (юридическое) лицо, индивидуальный предприниматель, акцептовавшее настоящий
        Договор.</p>
      <p>6. Продавец – ИП Порываев С.В. (ИНН 450101826438);</p>
      <p>7. Производитель – лицо, которое произвело Товар и выдало гарантию на Товар на условиях, указанных в
        гарантийном талоне.</p>
      <p>8. Акцепт (Безусловный акцепт) - в соответствии со ст. 438 ГК РФ полное и безоговорочное принятие Договора,
        осуществляемое путем Заказа Товара в Интернет-магазине.</p>
      <p>9. Персональные данные (ПДн) - информация, относящаяся к Покупателю, в том числе указанная им при оформлении
        Заказа.</p>
      <p>10. Обработка персональных данных - действия (операции), производимые в ручном или автоматическом режиме с
        персональными данными, включая сбор, систематизацию, накопление, хранение, уточнение (обновление, изменение),
        использование, распространение (в том числе передача), обезличивание, блокирование и уничтожение персональных
        данных.</p>
      <p>11. Аналог собственноручной подписи - проставление отметки (галочки) в окошке «Согласен с условиями оферты»,
        размещенной на сайте http://....., а также при оформлении Заказа.</p>
      <p>12. Пункт самовывоза – месторасположение Продавца (курьерской компании, с которой у Продавца заключен
        соответствующий договор), где Покупатель самостоятельно получает Товар.</p>
      <p>13. Менеджер Продавца – сотрудник Продавца.</p>

      <h4>2. Предмет Договора.</h4>
      <p>1. Продавец обязуется передать в собственность Покупателю, а Покупатель обязуется оплатить и принять Товары,
        заказанные в Интернет-магазине.</p>
      <p>2. В случае несогласия Покупателя с какими-либо из положений настоящего Договора, Покупатель не в праве
        использовать Интернет-магазин. В случае если Продавцом были внесены какие-либо изменения в Договор, с которыми
        Покупатель не согласен, он обязан незамедлительно прекратить использование Интернет-Магазина.</p>
      <p>3. Продавец имеет право в любой момент внести изменения в настоящий Договор. Изменения вступают в силу на
        следующий календарный день после размещения новой редакции Договора.</p>
      <p>4. Покупатель обязуется самостоятельно знакомиться с актуальной редакцией Договора.</p>
      <p>5. Совершая Заказ Покупатель гарантирует, что полностью ознакомился с текстом настоящего Договора и принимает
        их условия.</p>

      <h4>3. Момент заключения Договора. Оформление Заказа.</h4>
      <p>1. Текст данного Договора является публичной офертой (в соответствии со статьей 435 и частью 2 статьи 437
        Гражданского кодекса РФ).</p>
      <p>2. Факт оформления Заказа является безоговорочным принятием данного Договора (безусловным акцептом), и
        Покупатель рассматривается как лицо, вступившее с Продавцом в договорные отношения.</p>
      <p>3. Выражая согласие с условиями настоящего Договора в порядке, предусмотренном п. 2.1., Покупатель
        подтверждает, что действует не в интересах третьих лиц, а исключительно от своего имени и в собственных
        интересах.</p>

      <h4>4. Оформление Заказа осуществляется путем заполнения и отправки Продавцу формы с указанием параметров
        Заказа:</h4>
      <p>- Наименование, количество, стоимость Товара;</p>
      <p>- ФИО Покупателя/ Наименование юридического лица;</p>
      <p>- Контактный телефон Покупателя;</p>
      <p>- Адрес электронной почты Покупателя;</p>
      <p>- Вариант доставки.</p>

      <h4>5. Заказ считается совершенным после подтверждения Заказа по телефону, указанному в Заказе, Менеджером
        Продавца.</h4>

      <p>1. Лицо действующее от имени юридического лица подтверждает наличие полномочий на совершение Заказа и Акцепт
        настоящего Договора.</p>
      <p>6. В случае, если у Продавца возникают основания предполагать, что предоставленная Покупателем при оформлении
        Заказа информация не соответствует действительности или предоставлена в неполном объеме, ему может быть отказано
        в приеме Заказа на временной или постоянной основе.</p>

      <p>7. Все поля Формы Заказа обязательны для заполнения Покупателем.</p>

      <p>8. Покупатель не имеет право указывать в Форме заказа данные третьих лиц.</p>

      <p>9. До момента оформления Заказа и заключения настоящего Договора Покупатель обязуется ознакомиться.</p>

      <p>0. С основными потребительскими свойствами Товара и местом изготовления Товара, стоимостью Товара. Указанная
        информация расположена рядом с изображением Товара.</p>

      <p>1. Способами оплаты Товара. Указанная информация расположена на Сайте Интернет-магазина http://....</p>

      <p>2. Способами и стоимостью Доставки Товара. Указанная информация расположена на Сайте Интернет-магазина
        http://....</p>

      <p>10. Продавец оставляет за собой право не доставлять Покупателю Заказ в случае, если у Покупателя есть
        неоплаченные Заказы.</p>

      <h4>4. Характеристики Товара.</h4>

      <p>1. Товар представлен в Интернет-магазине через фото-образцы, являющиеся собственностью Интернет-магазина.</p>

      <p>2. Каждый фото-образец сопровождается текстовой информацией: наименованием, размером, ценой за единицу и
        описанием Товара.</p>

      <p>3. Вся информация и характеристики Товара, представленные в Интернет магазине, носят справочный характер и не
        могут в полной мере передавать информацию о свойствах и характеристиках Товара, включая цвета, размеры и формы.
        В случае возникновения у Покупателя вопросов, касающихся свойств и характеристик товара, Покупатель должен,
        перед оформлением заказа, обратиться к Продавцу по телефонам, указанным на Сайте.</p>

      <p>4. В связи с разными техническими характеристиками цвет Товара может отличаться от представленного в
        Интернет-магазине.</p>

      <p>5. Характеристики и внешний вид Товара могут отличаться от предоставленных на Сайте.</p>

      <p>6. Продавец не несет ответственности за несоответствие Товара ожиданиям Покупателя.</p>

      <h4>5. Цена Товара.</h4>

      <p>1. Цены в Интернет-магазине указаны в валюте Российской Федерации за единицу Товара.</p>

      <p>2. Тарифы на оказание услуг по Доставке Товара размещены на Сайте и не включаются в цену Товара. Стоимость
        Доставки оплачивается Покупателем отдельно и не подлежит возврату в случае возврата (обмена) Товара.</p>

      <p>3. Доставка по России осуществляется Курьерскими компаниями по выбору Покупателя.</p>

      <p>4. Цена Товара не включает в себя стоимость подъема Товара на этаж и оплачивается Покупателем отдельно.
        Стоимость определяется индивидуально в зависимости от веса Товара, этажа подъёма и наличия грузового лифта.</p>

      <p>5. Указанная в Интернет-магазине цена Товара может быть изменена Продавцом в одностороннем порядке, при этом
        цена на заказанный и оплаченный Покупателем Товар изменению не подлежит.</p>

      <p>6. Сборка (установка) Товара не включена в цену Товара и не осуществляется Продавцом.</p>

      <h4>6. Оплата Товара.</h4>

      <p>1. Покупатель оплачивает Товар способами, указанными в Интернет-магазине в разделе «Оплата».</p>

      <p>2. При наличной форме оплаты Покупатель обязан уплатить Продавцу цену Товара в момент его передачи, а Продавец
        обязан предоставить Покупателю кассовый или товарный чек, или иной документ, подтверждающий оплату Товара.</p>

      <p>3. При безналичной форме оплаты обязанность Покупателя по уплате цены Товара считается исполненной с момента
        зачисления соответствующих денежных средств, в размере 100% (ста процентов) от стоимости товара на расчетный
        счет Продавца (Оператора по приему платежей).</p>

      <p>4. При оплате стоимости Заказа в порядке 100% (сто процентной) предоплаты Продавец осуществляет Доставку
        (выдачу) Товара Покупателю только после поступления оплаты на счет Продавца.</p>

      <p>5. В случае оформления Заказа Покупателем на доставку Товара, который отсутствует на складе Продавца, доставка
        такого Товара осуществляется на основании внесения Покупателем 100% предварительной оплаты в сроки,
        дополнительно согласованные с Продавцом посредством электронной почты, либо телефонной связи. При этом Продавец
        вправе в одностороннем порядке изменить сроки доставки такого Товара, также предварительно уведомив об этом
        Покупателя посредством электронной почты, либо телефонной связи. Информация о наличии либо отсутствии Товара на
        складе Продавца отражается на странице Сайта при оформлении Заказа Покупателем. Совершая Заказ Товара,
        отсутствующего на складе Продавца, Покупатель подтверждает, что он осведомлен и согласен с условиями доставки
        такого Товара, указанными в настоящем пункте Договора.</p>

      <p>6. Просрочка уплаты Покупателем цены Товара на срок свыше 5 (пяти) календарных дней с момента Заказа Товара
        является существенным нарушением настоящего договора. В этом случае Продавец вправе в одностороннем порядке
        отказаться от исполнения настоящего договора, уведомив об этом Покупателя.</p>

      <p>7. Покупатель за свой счет оплачивает комиссии (сборы) взимаемые кредитными организациями (платежными
        системами) при осуществлении оплаты.</p>

      <h4>7. Доставка Товара.</h4>

      <p>1. Доставка Товара Покупателю осуществляется по адресу и в сроки, согласованные Покупателем и Менеджером
        Продавца при оформлении заказа, либо Покупатель самостоятельно забирает Товар со склада Продавца по адресу,
        указанному в п. 16 настоящего Договора.</p>

      <p>2. Точная стоимость Доставки Товара определяется Менеджером Продавца при оформлении Заказа и не может быть
        изменена после согласования с Покупателем.</p>

      <p>3. Неявка Покупателя в течение 3-х рабочих дней или не совершение иных необходимых действий для принятия Товара
        могут рассматриваться Продавцом в качестве отказа Покупателя от исполнения Договора.</p>

      <p>4. Право собственности и риск случайной гибели, утраты или повреждения товара переходит к Покупателю с момента
        передачи Товара Покупателю или его Представителю.</p>

      <p>5. При доставке Товар вручается Покупателю или Представителю. Продавец не обязан проверять полномочия
        Представителя на прием Товара, если Представитель находится по адресу Доставки.</p>

      <p>6. Покупатель обязан принять Товар по наименованию, количеству и ассортименту в момент его приемки.</p>

      <p>7. Покупатель или Представитель Покупателя при приемке Товара подтверждает своей подписью в акте приемки
        Товара, что не имеет претензий к внешнему виду, наименованию. количеству и комплектности Товара, а также
        ознакомлен с правилами возврата (обмена) Товара.</p>

      <p>8. Доставка Товаров вне пределов г. Новосибирска и Новосибирской области может осуществляться по согласованию с
        Продавцом третьими лицами (Курьерскими компаниями). Выбор Курьерской компании осуществляется Покупателем.</p>

      <p>9. После отправки Товара Курьерской компанией Продавец сообщает Покупателю данные необходимые для идентификации
        Товара.</p>

      <p>10. Покупатель обязуется обеспечить надлежащую приёмку Товара от Курьерской компании. При приеме Товара от
        транспортной компании Покупатель обязан осмотреть Товар на предмет наличия и целостности упаковки. В случае
        повреждений упаковки и иных дефектов Покупатель обязан сделать соответствующие пометки .</p>

      <p>транспортных накладных (актах). В противном случае последующие претензии о некомплектности или повреждении
        Товара не принимаются Продавцом.</p>

      <p>11. Покупатель обязуется возместить Продавцу документально подтвержденные расходы, вызванные неприемом Товара в
        назначенный день (в том числе услуги Курьерской компании по ответственному хранению непринятого Товара, услуги
        по повторной доставке Товара).</p>

      <p>12. В случае, если при приемке Товара от транспортной компании Покупатель отказывается от Товара он обязан
        незамедлительно уведомить от этого Продавца по реквизитам, указанным в разделе 16. В противном случае, Продавец
        имеет право возложить на Покупателя возмещение расходов по ответственному хранению Товара транспортной
        компанией.</p>

      <p>13. В случае отказа Покупателя от Товара, не в связи с нарушением условий о качестве Товара, Покупатель
        возмещает Продавцу расходы по доставке и возврату Товара.</p>

      <h4>8. Гарантии на Товар.</h4>

      <p>1. Товары имеют все необходимые сертификаты качества и гарантийные талоны.</p>

      <p>2. Гарантийный срок на Товар устанавливает Производитель. Гарантийный срок указывается в гарантийном
        талоне.</p>

      <p>3. Любые Товары, приобретенные в Интернет-магазине, в случае неисправности обслуживаются по гарантии
        сервис-центрами, авторизованными Производителями, на основании гарантийных талонов, прилагаемых к Товару. Адреса
        и телефоны сервисных центров указаны в гарантийном талоне.</p>

      <h4>9. Права и обязанности Сторон.</h4>

      <p>1. Продавец обязуется.</p>

      <p>- не разглашать любые Персональные данные Покупателя и не предоставлять доступ к этой информации третьим лицам,
        за исключением случаев, предусмотренных законодательством РФ и настоящим Договором.</p>

      <p>- предоставить Покупателю возможность получения бесплатных телефонных консультаций по телефонам, указанным на
        Сайте. Объем консультаций ограничивается конкретными вопросами, связанными с выполнениями Заказа и
        характеристиками Товара.</p>

      <p>2. Покупатель обязуется.</p>

      <p>- до момента заключения Договора ознакомиться с содержанием настоящего Договора, условиями оплаты и доставки на
        Сайте.</p>

      <p>- предоставлять достоверную информацию о себе (ФИО, контактные телефоны, адрес электронной почты, наименование
        юридического лица) и реквизиты для доставки Товара.</p>

      <p>- принять и оплатить Товар в указанные в настоящем Договоре сроки.</p>

      <p>3. В случае выполнения Продавцом Заказа на сумму свыше 100 000 (ста тысяч) рублей, между Продавцом и
        Покупателем заключается отдельный Договор в соответствии с законодательством РФ.</p>

      <p>4. В случае оформления Заказа на общую сумму, равную, либо превышающую 200 000 (двести тысяч) рублей, такой
        Заказ Покупателя принимается к исполнению с момента его 100% предварительной оплаты, в порядке, предусмотренном
        разделом 6 настоящей публичной оферты.</p>

      <h4>10. Ответственность сторон и разрешение споров.</h4>

      <p>1. Стороны несут ответственность за неисполнение или ненадлежащее исполнение настоящего Договора в порядке,
        предусмотренном настоящим Договором и действующим законодательством РФ.</p>

      <p>2. Продавец не несет ответственности за Доставку Заказа, если Покупателем указан неправильный адрес
        Доставки.</p>

      <p>3. Продавец не несет ответственности, если ожидания Покупателя о потребительских свойствах Товара оказались не
        оправданны.</p>

      <p>4. Продавец не несет ответственности за частичное или полное неисполнение обязательств по доставке Товара, если
        они являются следствием форс-мажорных обстоятельств.</p>

      <p>5. Все споры и разногласия, возникающие при исполнении Сторонами обязательств по настоящему Договору, решаются
        путем переговоров. В случае невозможности их устранения, Стороны имеют право обратиться за судебной защитой
        своих интересов.</p>

      <p>6. Стороны установили необходимость соблюдения обязательного досудебного претензионного порядка до обращения в
        суд. Срок ответа на претензию устанавливается – 10 (десять) календарных дней.</p>

      <h4>11. Возврат и обмен Товара.</h4>

      <p>1. Покупатель имеет право отказаться от Товара надлежащего качества, в случае, когда он не подошел по
        каким-либо причинам, в любое время до его передачи, а также после передачи, в течение 7 (семи) дней, не считая
        дня его покупки.</p>

      <p>2. Для осуществления возврата Товара необходимо чтобы.</p>

      <p>- Товар не был в употреблении, были сохранены его потребительские свойства, товарный вид, упаковка, пломбы,
        ярлыки, а также товарный или кассовый чек, документация к товару.</p>

      <p>- Товар являлся товаром надлежащего качества (исправен, не имел вмятин, трещин, царапин, сколов и других
        механических повреждений, за исключением скрытых производственных дефектов).</p>

      <p>3. При наличии претензий к внешнему виду и комплектности товара Покупатель может отказаться от приобретения
        Товара до момента передачи Товара. Претензии к внешнему виду доставленного Товара Покупатель имеет право
        предъявить только до передачи Товара Продавцом. Ссылки на загрязнённость Товара, недостаточную освещённость
        помещения, поторапливания со стороны экспедиторов Продавца и прочие причины, не являются основанием для
        невыполнения Покупателем своих обязательств.</p>

      <p>4. Покупатель компенсирует Продавцу необходимые транспортные расходы, понесенные в связи с организацией обмена
        или возврата Товара, с учетом норм действующего законодательства РФ.</p>

      <p>5. Индивидуально изготовленные Товары возврату или обмену не подлежат.</p>

      <p>12. Форс-мажорные обстоятельства.</p>

      <p>1. Стороны освобождаются от ответственности за неисполнение или ненадлежащее исполнение обязательств по
        Договору на время действия непреодолимой силы. Под непреодолимой силой понимаются чрезвычайные и непреодолимые
        при данных условиях обстоятельства, препятствующие исполнению своих обязательств Сторонами по настоящему
        Договору. К ним относятся стихийные явления (землетрясения, наводнения и т. п.), обстоятельства общественной
        жизни (военные действия, чрезвычайные положения, крупнейшие забастовки, эпидемии и т. п.), запретительные меры
        государственных органов (запрещение перевозок, валютные ограничения, международные санкции запрета на торговлю и
        т. п.). В течение этого времени Стороны не имеют взаимных претензий, и каждая из Сторон принимает на себя свой
        риск последствия форс-мажорных обстоятельств.</p>

      <h4>13. Срок действия Договора.</h4>

      <p>1. Договор вступает в силу с момента Безусловного акцепта Покупателем и действует до исполнения обязательств
        Сторонами.</p>

      <p>14. Согласие на обработку Персональных данных Покупателя.</p>

      <p>1. Оформляя Заказ на Сайте, Покупатель подтверждает свое согласие на обработку Продавцом своих персональных
        данных.</p>

      <p>2. Перечень ПДн, на обработку, которых дается согласие.</p>

      <p>- ФИО.</p>

      <p>- Контактный телефон.</p>

      <p>- Адрес электронной почты.</p>

      <p>3. Перечень действий с ПДн, на совершение которых Покупателем дается согласие на следующие способы
        использования ПДн.</p>

      <p>- Получение и Хранение ПДн (в электронном виде и на бумажном носителе).</p>

      <p>- Уточнение (обновление, изменение) ПДн.</p>

      <p>- Использование ПДн для исполнения настоящего Договора.</p>

      <p>- Передача ПДн Покупателя в порядке, предусмотренном законодательством РФ.</p>

      <p>- В целях рассылки каталогов, в маркетинговых и в иных коммерческих целях.</p>

      <p>- На передачу ПДн любым третьим лицам на территории Российской Федерации.</p>

      <p>4. Согласие Покупателя на обработку персональных данных предоставляется без ограничения срока его действия.</p>

      <p>5. Покупатель, исключительно по личному заявлению, имеет право отозвать (изменить) настоящее согласие на
        обработку ПДн.</p>

      <p>6. Продавец обеспечивает конфиденциальность ПДн в соответствии с требованиями действующего законодательства
        РФ.</p>

      <h4>15. Иные положения.</h4>

      <p>1. Покупатель понимает и принимает условия о том, что информация, характеристики Товара, в связи с временно
        возникающими техническими ошибками на Сайте могут искажаться. В случае возникновения технической ошибки на Сайте
        Продавец оставляет за собой право отозвать настоящую оферту.</p>

      <p>2. Стороны осуществляют взаимодействие по реквизитам.</p>

      <p>- Для Продавца-указанным в п. 16. Настоящего Договора.</p>

      <p>- Для Покупателя-указанным при осуществлении Заказа.</p>

      <h4>16. Реквизиты Продавца.</h4>

      <p>- ИП Порываев С.В.</p>

      <p>- 633009, Бердск, Берёзовая , 2.</p>

      <p>- ИНН: 45010182643.</p>

      <p>- Контактный телефон: 8 (913) 394 25 65.</p>
      <el-button class="primary_btn" @click="dialog = false">Ок</el-button>
    </el-dialog>
  </div>
</template>

<script>
  export default {
    name: "PrivacyDialog",
    data() {
      return {
        dialog: false
      }
    }
  }
</script>

<style scoped>

</style>
